Revit 2027 API
Revolution.Sketch Property
Returns the Sketch of the Revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Sketch Sketch { get; }
Public ReadOnly Property Sketch As Sketch
	Get
public:
property Sketch^ Sketch {
	Sketch^ get ();
}
member Sketch : Sketch with get
Property Value
Sketch
Remarks
This property is used to retrieve the Sketch of the Revolution.
See Also
Reference
Revolution Class
Autodesk.Revit.DB Namespace